OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1614.h
#define _AT1CC18                0x01
#define _CC18                   0x01
#define _AT1CC19                0x02
#define _CC19                   0x02

//==============================================================================


//==============================================================================
//        AT1CCON1 Bits

extern __at(0x0891) __sfr AT1CCON1;

typedef union
  {
  struct
    {
    unsigned AT1CC1MODE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CAP1P           : 1;
    unsigned AT1CC1POL          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CC1EN           : 1;
    };

  struct
    {
    unsigned CC1MODE            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CAP1P              : 1;
    unsigned CC1POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CC1EN              : 1;
    };
  } __AT1CCON1bits_t;

extern __at(0x0891) volatile __AT1CCON1bits_t AT1CCON1bits;

#define _AT1CC1MODE             0x01
#define _CC1MODE                0x01
#define _AT1CAP1P               0x08
#define _CAP1P                  0x08
#define _AT1CC1POL              0x10
#define _CC1POL                 0x10
#define _AT1CC1EN               0x80
#define _CC1EN                  0x80

//==============================================================================


//==============================================================================
//        AT1CSEL2 Bits

extern __at(0x0892) __sfr AT1CSEL2;

typedef union
  {
  struct
    {
    unsigned AT1CP2S0           : 1;
    unsigned AT1CP2S1           : 1;
    unsigned AT1CP2S2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CP2S0              : 1;
    unsigned CP2S1              : 1;
    unsigned CP2S2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CP2S               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned AT1CP2S            : 3;
    unsigned                    : 5;
    };
  } __AT1CSEL2bits_t;

extern __at(0x0892) volatile __AT1CSEL2bits_t AT1CSEL2bits;

#define _AT1CP2S0               0x01
#define _CP2S0                  0x01
#define _AT1CP2S1               0x02
#define _CP2S1                  0x02
#define _AT1CP2S2               0x04
#define _CP2S2                  0x04

//==============================================================================

extern __at(0x0893) __sfr AT1CC2;

//==============================================================================
//        AT1CC2L Bits

extern __at(0x0893) __sfr AT1CC2L;

typedef union
  {
  struct
    {
    unsigned AT1CC20            : 1;
    unsigned AT1CC21            : 1;
    unsigned AT1CC22            : 1;
    unsigned AT1CC23            : 1;
    unsigned AT1CC24            : 1;
    unsigned AT1CC25            : 1;
    unsigned AT1CC26            : 1;
    unsigned AT1CC27            : 1;
    };

  struct
    {
    unsigned CC20               : 1;
    unsigned CC21               : 1;
    unsigned CC22               : 1;
    unsigned CC13               : 1;
    unsigned CC24               : 1;
    unsigned CCW5               : 1;
    unsigned CC26               : 1;
    unsigned CC27               : 1;
    };
  } __AT1CC2Lbits_t;

extern __at(0x0893) volatile __AT1CC2Lbits_t AT1CC2Lbits;

#define _AT1CC2L_AT1CC20        0x01
#define _AT1CC2L_CC20           0x01
#define _AT1CC2L_AT1CC21        0x02
#define _AT1CC2L_CC21           0x02
#define _AT1CC2L_AT1CC22        0x04
#define _AT1CC2L_CC22           0x04
#define _AT1CC2L_AT1CC23        0x08
#define _AT1CC2L_CC13           0x08
#define _AT1CC2L_AT1CC24        0x10
#define _AT1CC2L_CC24           0x10
#define _AT1CC2L_AT1CC25        0x20
#define _AT1CC2L_CCW5           0x20
#define _AT1CC2L_AT1CC26        0x40
#define _AT1CC2L_CC26           0x40
#define _AT1CC2L_AT1CC27        0x80
#define _AT1CC2L_CC27           0x80

//==============================================================================


//==============================================================================
//        AT1CC2H Bits

extern __at(0x0894) __sfr AT1CC2H;

typedef union
  {
  struct
    {
    unsigned AT1CC28            : 1;
    unsigned AT1CC29            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CC28               : 1;
    unsigned CC29               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1CC2Hbits_t;

extern __at(0x0894) volatile __AT1CC2Hbits_t AT1CC2Hbits;

#define _AT1CC28                0x01
#define _CC28                   0x01
#define _AT1CC29                0x02
#define _CC29                   0x02

//==============================================================================


//==============================================================================
//        AT1CCON2 Bits

extern __at(0x0895) __sfr AT1CCON2;

typedef union
  {
  struct
    {
    unsigned AT1CC2MODE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CAP2P           : 1;
    unsigned AT1CC2POL          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CC2EN           : 1;
    };

  struct
    {
    unsigned CC2MODE            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CAP2P              : 1;
    unsigned CC2POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CC2EN              : 1;
    };
  } __AT1CCON2bits_t;

extern __at(0x0895) volatile __AT1CCON2bits_t AT1CCON2bits;

#define _AT1CC2MODE             0x01
#define _CC2MODE                0x01
#define _AT1CAP2P               0x08
#define _CAP2P                  0x08
#define _AT1CC2POL              0x10
#define _CC2POL                 0x10
#define _AT1CC2EN               0x80
#define _CC2EN                  0x80

//==============================================================================


//==============================================================================
//        AT1CSEL3 Bits

