OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1614.h
#define _CKPPS0                 0x01
#define _CKPPS1                 0x02
#define _CKPPS2                 0x04
#define _CKPPS3                 0x08
#define _CKPPS4                 0x10

//==============================================================================


//==============================================================================
//        SMT1SIGPPS Bits

extern __at(0x0E26) __sfr SMT1SIGPPS;

typedef union
  {
  struct
    {
    unsigned SMT1SIGPPS0        : 1;
    unsigned SMT1SIGPPS1        : 1;
    unsigned SMT1SIGPPS2        : 1;
    unsigned SMT1SIGPPS3        : 1;
    unsigned SMT1SIGPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMT1SIGPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT1SIGPPSbits_t;

extern __at(0x0E26) volatile __SMT1SIGPPSbits_t SMT1SIGPPSbits;

#define _SMT1SIGPPS0            0x01
#define _SMT1SIGPPS1            0x02
#define _SMT1SIGPPS2            0x04
#define _SMT1SIGPPS3            0x08
#define _SMT1SIGPPS4            0x10

//==============================================================================


//==============================================================================
//        SMT1WINPPS Bits

extern __at(0x0E27) __sfr SMT1WINPPS;

typedef union
  {
  struct
    {
    unsigned SMTWINPPS0         : 1;
    unsigned SMTWINPPS1         : 1;
    unsigned SMTWINPPS2         : 1;
    unsigned SMTWINPPS3         : 1;
    unsigned SMTWINPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMTWINPPS          : 5;
    unsigned                    : 3;
    };
  } __SMT1WINPPSbits_t;

extern __at(0x0E27) volatile __SMT1WINPPSbits_t SMT1WINPPSbits;

#define _SMTWINPPS0             0x01
#define _SMTWINPPS1             0x02
#define _SMTWINPPS2             0x04
#define _SMTWINPPS3             0x08
#define _SMTWINPPS4             0x10

//==============================================================================


//==============================================================================
//        CLCIN0PPS Bits

extern __at(0x0E28) __sfr CLCIN0PPS;

typedef union
  {
  struct
    {
    unsigned CLCIN0PPS0         : 1;
    unsigned CLCIN0PPS1         : 1;
    unsigned CLCIN0PPS2         : 1;
    unsigned CLCIN0PPS3         : 1;
    unsigned CLCIN0PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CLCIN0PPS          : 5;
    unsigned                    : 3;
    };
  } __CLCIN0PPSbits_t;

extern __at(0x0E28) volatile __CLCIN0PPSbits_t CLCIN0PPSbits;

#define _CLCIN0PPS0             0x01
#define _CLCIN0PPS1             0x02
#define _CLCIN0PPS2             0x04
#define _CLCIN0PPS3             0x08
#define _CLCIN0PPS4             0x10

//==============================================================================


//==============================================================================
//        CLCIN1PPS Bits

extern __at(0x0E29) __sfr CLCIN1PPS;

typedef union
  {
  struct
    {
    unsigned CLCIN1PPS0         : 1;
    unsigned CLCIN1PPS1         : 1;
    unsigned CLCIN1PPS2         : 1;
    unsigned CLCIN1PPS3         : 1;
    unsigned CLCIN1PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CLCIN1PPS          : 5;
    unsigned                    : 3;
    };
  } __CLCIN1PPSbits_t;

extern __at(0x0E29) volatile __CLCIN1PPSbits_t CLCIN1PPSbits;

#define _CLCIN1PPS0             0x01
#define _CLCIN1PPS1             0x02
#define _CLCIN1PPS2             0x04
#define _CLCIN1PPS3             0x08
#define _CLCIN1PPS4             0x10

//==============================================================================


//==============================================================================
//        CLCIN2PPS Bits

extern __at(0x0E2A) __sfr CLCIN2PPS;

typedef union
  {
  struct
    {
    unsigned CLCIN2PPS0         : 1;
    unsigned CLCIN2PPS1         : 1;
    unsigned CLCIN2PPS2         : 1;
    unsigned CLCIN2PPS3         : 1;
    unsigned CLCIN2PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CLCIN2PPS          : 5;
    unsigned                    : 3;
    };
  } __CLCIN2PPSbits_t;

extern __at(0x0E2A) volatile __CLCIN2PPSbits_t CLCIN2PPSbits;

#define _CLCIN2PPS0             0x01
#define _CLCIN2PPS1             0x02
#define _CLCIN2PPS2             0x04
#define _CLCIN2PPS3             0x08
#define _CLCIN2PPS4             0x10

//==============================================================================


//==============================================================================
//        CLCIN3PPS Bits

extern __at(0x0E2B) __sfr CLCIN3PPS;

typedef union
  {
  struct
    {
    unsigned CLCIN3PPS0         : 1;
    unsigned CLCIN3PPS1         : 1;
    unsigned CLCIN3PPS2         : 1;
    unsigned CLCIN3PPS3         : 1;
    unsigned CLCIN3PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CLCIN3PPS          : 5;
    unsigned                    : 3;
    };
  } __CLCIN3PPSbits_t;

extern __at(0x0E2B) volatile __CLCIN3PPSbits_t CLCIN3PPSbits;

#define _CLCIN3PPS0             0x01
#define _CLCIN3PPS1             0x02
#define _CLCIN3PPS2             0x04
#define _CLCIN3PPS3             0x08
#define _CLCIN3PPS4             0x10

//==============================================================================


//==============================================================================
//        SMT2SIGPPS Bits

extern __at(0x0E2C) __sfr SMT2SIGPPS;

typedef union
  {
  struct
    {
    unsigned SMT2SIGPPS0        : 1;
    unsigned SMT2SIGPPS1        : 1;
    unsigned SMT2SIGPPS2        : 1;
    unsigned SMT2SIGPPS3        : 1;
    unsigned SMT2SIGPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMT2SIGPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT2SIGPPSbits_t;

extern __at(0x0E2C) volatile __SMT2SIGPPSbits_t SMT2SIGPPSbits;

#define _SMT2SIGPPS0            0x01
#define _SMT2SIGPPS1            0x02
#define _SMT2SIGPPS2            0x04
#define _SMT2SIGPPS3            0x08
#define _SMT2SIGPPS4            0x10

//==============================================================================


//==============================================================================
//        SMT2WINPPS Bits

extern __at(0x0E2D) __sfr SMT2WINPPS;

typedef union
  {
  struct
    {
    unsigned SMT2WINPPS0        : 1;
    unsigned SMT2WINPPS1        : 1;
    unsigned SMT2WINPPS2        : 1;
    unsigned SMT2WINPPS3        : 1;
    unsigned SMT2WINPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SMT2WINPPS         : 5;
    unsigned                    : 3;
    };
  } __SMT2WINPPSbits_t;

extern __at(0x0E2D) volatile __SMT2WINPPSbits_t SMT2WINPPSbits;

#define _SMT2WINPPS0            0x01
#define _SMT2WINPPS1            0x02
#define _SMT2WINPPS2            0x04
#define _SMT2WINPPS3            0x08
#define _SMT2WINPPS4            0x10

//==============================================================================


//==============================================================================
//        ATCC3PPS Bits

extern __at(0x0E2E) __sfr ATCC3PPS;

typedef union
  {
  struct
    {
    unsigned ATCC3PPS0          : 1;
    unsigned ATCC3PPS1          : 1;
    unsigned ATCC3PPS2          : 1;
    unsigned ATCC3PPS3          : 1;
    unsigned ATCC3PPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ATCC3PPS           : 5;
    unsigned                    : 3;
    };
  } __ATCC3PPSbits_t;

extern __at(0x0E2E) volatile __ATCC3PPSbits_t ATCC3PPSbits;

#define _ATCC3PPS0              0x01
#define _ATCC3PPS1              0x02
#define _ATCC3PPS2              0x04
#define _ATCC3PPS3              0x08
#define _ATCC3PPS4              0x10

//==============================================================================


//==============================================================================
//        RA0PPS Bits

extern __at(0x0E90) __sfr RA0PPS;

typedef union
  {
  struct
    {
    unsigned RA0PPS0            : 1;
    unsigned RA0PPS1            : 1;
    unsigned RA0PPS2            : 1;
    unsigned RA0PPS3            : 1;
    unsigned RA0PPS4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA0PPS             : 5;
    unsigned                    : 3;
    };
  } __RA0PPSbits_t;

extern __at(0x0E90) volatile __RA0PPSbits_t RA0PPSbits;

#define _RA0PPS0                0x01
#define _RA0PPS1                0x02
#define _RA0PPS2                0x04
#define _RA0PPS3                0x08
#define _RA0PPS4                0x10

//==============================================================================


//==============================================================================
//        RA1PPS Bits

extern __at(0x0E91) __sfr RA1PPS;

typedef union
  {
  struct
    {
    unsigned RA1PPS0            : 1;
    unsigned RA1PPS1            : 1;
    unsigned RA1PPS2            : 1;
    unsigned RA1PPS3            : 1;
    unsigned RA1PPS4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA1PPS             : 5;
    unsigned                    : 3;
    };
  } __RA1PPSbits_t;

extern __at(0x0E91) volatile __RA1PPSbits_t RA1PPSbits;

#define _RA1PPS0                0x01
#define _RA1PPS1                0x02
#define _RA1PPS2                0x04
#define _RA1PPS3                0x08
#define _RA1PPS4                0x10

//==============================================================================


//==============================================================================
//        RA2PPS Bits

extern __at(0x0E92) __sfr RA2PPS;

typedef union
  {
  struct
    {
    unsigned RA2PPS0            : 1;
    unsigned RA2PPS1            : 1;
    unsigned RA2PPS2            : 1;
    unsigned RA2PPS3            : 1;
    unsigned RA2PPS4            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA2PPS             : 5;
    unsigned                    : 3;
    };
  } __RA2PPSbits_t;

