OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1614.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1, shadows bit in ADCON0bits
#define ADGO                    ADCON0bits.ADGO                 // bit 1, shadows bit in ADCON0bits
#define GO                      ADCON0bits.GO                   // bit 1, shadows bit in ADCON0bits
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define CHS3                    ADCON0bits.CHS3                 // bit 5
#define CHS4                    ADCON0bits.CHS4                 // bit 6

#define ADPREF0                 ADCON1bits.ADPREF0              // bit 0
#define ADPREF1                 ADCON1bits.ADPREF1              // bit 1
#define ADCS0                   ADCON1bits.ADCS0                // bit 4
#define ADCS1                   ADCON1bits.ADCS1                // bit 5
#define ADCS2                   ADCON1bits.ADCS2                // bit 6
#define ADFM                    ADCON1bits.ADFM                 // bit 7

#define TRIGSEL0                ADCON2bits.TRIGSEL0             // bit 4
#define TRIGSEL1                ADCON2bits.TRIGSEL1             // bit 5
#define TRIGSEL2                ADCON2bits.TRIGSEL2             // bit 6
#define TRIGSEL3                ADCON2bits.TRIGSEL3             // bit 7

#define ANSA0                   ANSELAbits.ANSA0                // bit 0
#define ANSA1                   ANSELAbits.ANSA1                // bit 1
#define ANSA2                   ANSELAbits.ANSA2                // bit 2
#define ANSA4                   ANSELAbits.ANSA4                // bit 4

#define ANSC0                   ANSELCbits.ANSC0                // bit 0
#define ANSC1                   ANSELCbits.ANSC1                // bit 1
#define ANSC2                   ANSELCbits.ANSC2                // bit 2
#define ANSC3                   ANSELCbits.ANSC3                // bit 3

#define AT1CC18                 AT1CC1Hbits.AT1CC18             // bit 0, shadows bit in AT1CC1Hbits
#define CC18                    AT1CC1Hbits.CC18                // bit 0, shadows bit in AT1CC1Hbits
#define AT1CC19                 AT1CC1Hbits.AT1CC19             // bit 1, shadows bit in AT1CC1Hbits
#define CC19                    AT1CC1Hbits.CC19                // bit 1, shadows bit in AT1CC1Hbits

#define AT1CC10                 AT1CC1Lbits.AT1CC10             // bit 0, shadows bit in AT1CC1Lbits
#define CC10                    AT1CC1Lbits.CC10                // bit 0, shadows bit in AT1CC1Lbits
#define AT1CC11                 AT1CC1Lbits.AT1CC11             // bit 1, shadows bit in AT1CC1Lbits
#define CC11                    AT1CC1Lbits.CC11                // bit 1, shadows bit in AT1CC1Lbits
#define AT1CC12                 AT1CC1Lbits.AT1CC12             // bit 2, shadows bit in AT1CC1Lbits
#define CC12                    AT1CC1Lbits.CC12                // bit 2, shadows bit in AT1CC1Lbits
#define AT1CC13                 AT1CC1Lbits.AT1CC13             // bit 3, shadows bit in AT1CC1Lbits
#define CC13                    AT1CC1Lbits.CC13                // bit 3, shadows bit in AT1CC1Lbits
#define AT1CC14                 AT1CC1Lbits.AT1CC14             // bit 4, shadows bit in AT1CC1Lbits
#define CC14                    AT1CC1Lbits.CC14                // bit 4, shadows bit in AT1CC1Lbits
#define AT1CC15                 AT1CC1Lbits.AT1CC15             // bit 5, shadows bit in AT1CC1Lbits
#define CC15                    AT1CC1Lbits.CC15                // bit 5, shadows bit in AT1CC1Lbits
#define AT1CC16                 AT1CC1Lbits.AT1CC16             // bit 6, shadows bit in AT1CC1Lbits
#define CC16                    AT1CC1Lbits.CC16                // bit 6, shadows bit in AT1CC1Lbits
#define AT1CC17                 AT1CC1Lbits.AT1CC17             // bit 7, shadows bit in AT1CC1Lbits
#define CC17                    AT1CC1Lbits.CC17                // bit 7, shadows bit in AT1CC1Lbits

#define AT1CC28                 AT1CC2Hbits.AT1CC28             // bit 0, shadows bit in AT1CC2Hbits
#define CC28                    AT1CC2Hbits.CC28                // bit 0, shadows bit in AT1CC2Hbits
#define AT1CC29                 AT1CC2Hbits.AT1CC29             // bit 1, shadows bit in AT1CC2Hbits
#define CC29                    AT1CC2Hbits.CC29                // bit 1, shadows bit in AT1CC2Hbits

#define AT1CC38                 AT1CC3Hbits.AT1CC38             // bit 0, shadows bit in AT1CC3Hbits
#define CC38                    AT1CC3Hbits.CC38                // bit 0, shadows bit in AT1CC3Hbits
#define AT1CC39                 AT1CC3Hbits.AT1CC39             // bit 1, shadows bit in AT1CC3Hbits
#define CC39                    AT1CC3Hbits.CC39                // bit 1, shadows bit in AT1CC3Hbits

#define AT1CC30                 AT1CC3Lbits.AT1CC30             // bit 0, shadows bit in AT1CC3Lbits
#define CC30                    AT1CC3Lbits.CC30                // bit 0, shadows bit in AT1CC3Lbits
#define AT1CC31                 AT1CC3Lbits.AT1CC31             // bit 1, shadows bit in AT1CC3Lbits
#define CC31                    AT1CC3Lbits.CC31                // bit 1, shadows bit in AT1CC3Lbits
#define AT1CC32                 AT1CC3Lbits.AT1CC32             // bit 2, shadows bit in AT1CC3Lbits
#define CC32                    AT1CC3Lbits.CC32                // bit 2, shadows bit in AT1CC3Lbits
#define AT1CC33                 AT1CC3Lbits.AT1CC33             // bit 3, shadows bit in AT1CC3Lbits
#define CC33                    AT1CC3Lbits.CC33                // bit 3, shadows bit in AT1CC3Lbits
#define AT1CC34                 AT1CC3Lbits.AT1CC34             // bit 4, shadows bit in AT1CC3Lbits
#define CC34                    AT1CC3Lbits.CC34                // bit 4, shadows bit in AT1CC3Lbits
#define AT1CC35                 AT1CC3Lbits.AT1CC35             // bit 5, shadows bit in AT1CC3Lbits
#define CC35                    AT1CC3Lbits.CC35                // bit 5, shadows bit in AT1CC3Lbits
#define AT1CC36                 AT1CC3Lbits.AT1CC36             // bit 6, shadows bit in AT1CC3Lbits
#define CC36                    AT1CC3Lbits.CC36                // bit 6, shadows bit in AT1CC3Lbits
#define AT1CC37                 AT1CC3Lbits.AT1CC37             // bit 7, shadows bit in AT1CC3Lbits
#define CC37                    AT1CC3Lbits.CC37                // bit 7, shadows bit in AT1CC3Lbits

#define AT1CC1MODE              AT1CCON1bits.AT1CC1MODE         // bit 0, shadows bit in AT1CCON1bits
#define CC1MODE                 AT1CCON1bits.CC1MODE            // bit 0, shadows bit in AT1CCON1bits
#define AT1CAP1P                AT1CCON1bits.AT1CAP1P           // bit 3, shadows bit in AT1CCON1bits
#define CAP1P                   AT1CCON1bits.CAP1P              // bit 3, shadows bit in AT1CCON1bits
#define AT1CC1POL               AT1CCON1bits.AT1CC1POL          // bit 4, shadows bit in AT1CCON1bits
#define CC1POL                  AT1CCON1bits.CC1POL             // bit 4, shadows bit in AT1CCON1bits
#define AT1CC1EN                AT1CCON1bits.AT1CC1EN           // bit 7, shadows bit in AT1CCON1bits
#define CC1EN                   AT1CCON1bits.CC1EN              // bit 7, shadows bit in AT1CCON1bits

